erp3l/src/Documents/ПоступлениеИнвестиций/ПоступлениеИнвестиций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеИнвестиций</name>
  <registerRecords>AccumulationRegister.ДвижениеИнвестиций</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.СтатусыОбъектовИнвестирования</registerRecords>
  <registerRecords>InformationRegister.СамостоятельноеПризнаниеКонтроля</registerRecords>
  <registerRecords>InformationRegister.ПоследовательностиУчастия</registerRecords>
  <registerRecords>InformationRegister.ДатыПоследовательностейУчастия</registerRecords>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>DefinedType.ДоговорКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>Инвестиции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВДоверительномУправлении</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоГолосующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПривилегированных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КратностьВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МСО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МСФОУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбоснованиеКонтроля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектИнвестирования</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтношениеКГруппе</name>
    <type>
      <types>CatalogRef.ГруппыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрямаяДоля</name>
    <type>
      <types>DefinedType.ДоляВладенияНеотрицательное</types>
    </type>
  </attributes>
  <attributes>
    <name>РегламентированныйУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СамостоятельноеПризнаниеКонтроляНадИК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИностраннойКомпании</name>
    <type>
      <types>EnumRef.СтатусыИностранныхКомпаний</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетов</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРегламент</name>
    <type>
      <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетов</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
</mdclass:Document>

erp3l/src/Documents/ПоступлениеИнвестиций/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Получим значения констант.
	УстановитьПривилегированныйРежим(Истина);
	ЗначенияСценарийКИК						 = Константы.СценарийОтчетностиКИК.Получить();
	ЗначениеСценарийМСФО					 = Константы.СценарийМСФО.Получить();
	ЗначениеНалоговоеПланированиеИнвестиций	 = Константы.НалоговоеПланированиеИнвестиций.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если НЕ ЗначениеНалоговоеПланированиеИнвестиций И (Объект.МСФОУчет ИЛИ Объект.НалоговыйУчет) Тогда
		Элементы.ОтражениеВУчете.СписокВыбора.Удалить(3);
	КонецЕсли;
	
	Если (Объект.МСФОУчет = Объект.НалоговыйУчет) И (ЗначениеСценарийМСФО = ЗначенияСценарийКИК) Тогда
		Элементы.ОтражениеВУчете.СписокВыбора.Удалить(2);
		Элементы.ОтражениеВУчете.СписокВыбора.Удалить(1);
	КонецЕсли;
	
	Если Элементы.ОтражениеВУчете.СписокВыбора.Количество() = 1 Тогда
		Элементы.ОтражениеВУчете.Видимость = Ложь;
		Элементы.ДекорацияСценарий.Видимость = Ложь;
		Элементы.Сценарий.Видимость = Ложь;
	КонецЕсли;
	
	ИнвестицииВызовСервера.ПриСозданииНаСервере(ЭтаФорма, Документы.ПоступлениеИнвестиций.ПолучитьИменаСубконто());
	
	СтруктураДействий = Новый Структура("ЗаполнитьЭффективнуюДолю", ЭтаФорма);		
	ИнвестицииКлиентСервер.ЗаполнитьДокумент(ЭтаФорма.Объект, СтруктураДействий, КэшируемыеЗначения);
	
	ИнвестицииКлиентСервер.УправлениеФормой(ЭтаФорма);
	
	#Область УниверсальныеПроцессыСогласование
		ДействияСогласованиеУХСервер.НарисоватьПанельСогласованияИОпределитьСостояниеОбъекта(ЭтаФорма);
	#КонецОбласти
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_Контрагенты" Или ИмяСобытия = "Запись_Организации" Тогда
		ИнвестицииКлиентСервер.УправлениеФормой(ЭтаФорма);
		#Область УниверсальныеПроцессыСогласование
	ИначеЕсли ИмяСобытия = "ОбъектСогласован" Тогда 
		ОпределитьСостояниеОбъекта();
	ИначеЕсли ИмяСобытия = "ОбъектОтклонен" Тогда
		ОпределитьСостояниеОбъекта();
	ИначеЕсли ИмяСобытия = "МаршрутИнициализирован" Тогда
		ОпределитьСостояниеОбъекта();
	ИначеЕсли ИмяСобытия = "СостояниеЗаявкиПриИзменении" Тогда
		ОпределитьСостояниеОбъекта();
		#КонецОбласти	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
			
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Оповестить("ИзмененыДвиженияИнвестиций");	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
				
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.МСФОУчет И Объект.НалоговыйУчет Тогда
		ОтражениеВУчете = 3;
	ИначеЕсли Объект.НалоговыйУчет Тогда
		ОтражениеВУчете = 2;
	ИначеЕсли Объект.МСФОУчет Тогда
		ОтражениеВУчете = 1;
	Иначе
		ОтражениеВУчете = 0;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СамостоятельноеПризнаниеКонтроляНадИКПриИзменении(Элемент)
	ИнвестицииКлиентСервер.УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтражениеВУчетеПриИзменении(Элемент)
	
	Если ОтражениеВУчете = 0 Тогда
		Объект.РегламентированныйУчет = Ложь;
		Объект.НалоговыйУчет = Ложь;
		Объект.МСФОУчет = Ложь;
	ИначеЕсли ОтражениеВУчете = 1 Тогда
		Объект.РегламентированныйУчет = Ложь;
		Объект.НалоговыйУчет = Ложь;
		Объект.МСФОУчет = Истина;
	ИначеЕсли ОтражениеВУчете = 2 Тогда
		Объект.НалоговыйУчет = Истина;
		Объект.МСФОУчет = Ложь;
	Иначе 
		Объект.НалоговыйУчет = Истина;
		Объект.МСФОУчет = Истина;
	КонецЕсли;
	
	СтруктураДействий = Новый Структура("ЗаполнитьЭффективнуюДолю,ЗаполнитьСчетаДокумента,РассчитатьОтношениеКГруппе", ЭтаФорма, Новый Структура("ИзмененОбъектИнвестирования", Истина));
	ИнвестицииКлиентСервер.ЗаполнитьДокумент(ЭтаФорма.Объект, СтруктураДействий, КэшируемыеЗначения);
	ИнвестицииКлиентСервер.УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	СтруктураДействий = Новый Структура("РассчитатьОтношениеКГруппе");
	СтруктураДействий.Вставить("ЗаполнитьЭффективнуюДолю", ЭтаФорма);
	СтруктураДействий.Вставить("ЗаполнитьСчетаДокумента", Новый Структура("ИзмененОбъектИнвестирования", Ложь));
	СтруктураДействий.Вставить("ЗаполнитьВалютуДокумента", Новый Структура("ЗаполнитьВалютуИзДоговора", Ложь));
		
	ИнвестицииКлиентСервер.ЗаполнитьДокумент(ЭтаФорма.Объект, СтруктураДействий, КэшируемыеЗначения);
	ИнвестицииКлиентСервер.УправлениеФормой(ЭтаФорма);
	#Если ВебКлиент Тогда
	ОпределитьСостояниеОбъекта(Истина);	
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ОбъектИнвестированияПриИзменении(Элемент)
	
	СтруктураДействий = Новый Структура("РассчитатьОтношениеКГруппе");
	СтруктураДействий.Вставить("ЗаполнитьЭффективнуюДолю", ЭтаФорма);
	СтруктураДействий.Вставить("ЗаполнитьСчетаДокумента", Новый Структура("ИзмененОбъектИнвестирования", Истина));
	
	ИнвестицииКлиентСервер.ЗаполнитьДокумент(ЭтаФорма.Объект, СтруктураДействий, КэшируемыеЗначения);
	ИнвестицииКлиентСервер.УправлениеФормой(ЭтаФорма);
	#Если ВебКлиент Тогда
	ОпределитьСостояниеОбъекта(Истина);	
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура РегламентированныйУчетПриИзменении(Элемент)
	
	СтруктураДействий = Новый Структура();
	СтруктураДействий.Вставить("ЗаполнитьСчетаДокумента", Новый Структура("ИзмененОбъектИнвестирования", Ложь));
	СтруктураДействий.Вставить("ЗаполнитьВалютуДокумента", Новый Структура("ЗаполнитьВалютуИзДоговора", Ложь));
	
	ИнвестицииКлиентСервер.ЗаполнитьДокумент(ЭтаФорма.Объект, СтруктураДействий, КэшируемыеЗначения);
	ИнвестицииКлиентСервер.УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьВалютуДокумента", Новый Структура("ЗаполнитьВалютуИзДоговора", Истина));
	
	ИнвестицииКлиентСервер.ЗаполнитьДокумент(ЭтаФорма.Объект, СтруктураДействий, КэшируемыеЗначения);
	ИнвестицииКлиентСервер.УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрямаяДоляПриИзменении(Элемент)
	
	СтруктураДействий = Новый Структура("ЗаполнитьЭффективнуюДолю,РассчитатьОтношениеКГруппе", ЭтаФорма);
		
	ИнвестицииКлиентСервер.ЗаполнитьДокумент(ЭтаФорма.Объект, СтруктураДействий, КэшируемыеЗначения);
	ИнвестицииКлиентСервер.УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СценарийПриИзменении(Элемент)
	
	СтруктураДействий = Новый Структура("РассчитатьОтношениеКГруппе");
	СтруктураДействий.Вставить("ЗаполнитьЭффективнуюДолю", ЭтаФорма);
	СтруктураДействий.Вставить("ЗаполнитьСчетаДокумента", Новый Структура("ИзмененОбъектИнвестирования", Ложь));
		
	ИнвестицииКлиентСервер.ЗаполнитьДокумент(ЭтаФорма.Объект, СтруктураДействий, КэшируемыеЗначения);
	ИнвестицииКлиентСервер.УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НалоговыйУчетПриИзменении(Элемент)
			
	СтруктураДействий = Новый Структура("РассчитатьОтношениеКГруппе");
		
	ИнвестицииКлиентСервер.ЗаполнитьДокумент(ЭтаФорма.Объект, СтруктураДействий, КэшируемыеЗначения);
	ИнвестицииКлиентСервер.УправлениеФормой(ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
		
	СтруктураДействий = Новый Структура("РассчитатьОтношениеКГруппе");
	СтруктураДействий.Вставить("ЗаполнитьЭффективнуюДолю", ЭтаФорма);
	ИнвестицииКлиентСервер.ЗаполнитьДокумент(ЭтаФорма.Объект, СтруктураДействий, КэшируемыеЗначения);	
	ИнвестицииКлиентСервер.УправлениеФормой(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаПриИзменении(Элемент)
	МСФОКлиентСерверУХ.ОбновитьСубконтоСчета(ЭтаФорма, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура СчетРасчетовПриИзменении(Элемент)
	МСФОКлиентСерверУХ.ОбновитьСубконтоСчета(ЭтаФорма, Элемент.Имя);
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыФункции

&НаСервере
Процедура ОпределитьСостояниеОбъекта(ОбновитьОтветственныхВход = Ложь)
	ДействияСогласованиеУХСервер.ОпределитьСостояниеЗаявки(ЭтаФорма, ОбновитьОтветственныхВход);
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение(Объект);
	ДокументОбъект.Заполнить(Новый Структура("ЗаполнитьПоОСВ", Истина));
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");

КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область УниверсальныеПроцессыСогласование

&НаКлиенте
Процедура СтатусОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	Если ВыбранноеЗначение = РеквизитСостояниеЗаявки(ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;

	Если Объект.Ссылка.Пустая() ИЛИ ЭтаФорма.Модифицированность Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("СостояниеЗаявкиОбработкаВыбораПродолжение", ЭтотОбъект, Новый Структура("ВыбранноеЗначение", ВыбранноеЗначение));
		ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
			|Изменение состояния возможно только после записи данных.
			|Данные будут записаны.'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
		Возврат;
	КонецЕсли;
	
	ИзменитьСостояниеЗаявкиКлиент(ВыбранноеЗначение); 

КонецПроцедуры

&НаКлиенте
Процедура СостояниеЗаявкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Если ВыбранноеЗначение = РеквизитСостояниеЗаявки(ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;

	Если Объект.Ссылка.Пустая() Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("СостояниеЗаявкиОбработкаВыбораПродолжение", ЭтотОбъект, Новый Структура("ВыбранноеЗначение", ВыбранноеЗначение));
		ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
			|Изменение состояния возможно только после записи данных.
			|Данные будут записаны.'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
		Возврат;
	КонецЕсли;
	
	ИзменитьСостояниеЗаявкиКлиент(ВыбранноеЗначение); 
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояниеЗаявкиКлиент(ВыбранноеЗначение)
	ДействияСогласованиеУХКлиент.ИзменитьСостояниеЗаявкиКлиент(ВыбранноеЗначение, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СостояниеЗаявкиОбработкаВыбораПродолжение(Результат, Параметры) Экспорт
 
	Если Результат = КодВозвратаДиалога.ОК Тогда
		Записать();
		ИзменитьСостояниеЗаявкиКлиент(Параметры.ВыбранноеЗначение);
	КонецЕсли;
 
КонецПроцедуры

&НаСервере
Функция ИзменитьСостояниеЗаявки(Ссылка, Состояние)
	
	Возврат УправлениеПроцессамиСогласованияУХ.ПеревестиЗаявкуВПроизвольноеСостояние(Ссылка, Состояние, , , ЭтаФорма);
	
КонецФункции

// Выводит на форму панель согасования и устанавливает обработчики событий
// для элементов панели.
&НаСервере
Процедура НарисоватьПанельСогласованияИОпределитьСостояниеОбъекта()
	МодульСогласованияДокументовУХ.НарисоватьПанельСогласования(Элементы, ЭтаФорма);
	ЭтаФорма.Команды["ПринятьКСогласованию"].Действие	 = "ПринятьКСогласованию_Подключаемый";
	ЭтаФорма.Команды["ИсторияСогласования"].Действие	 = "ИсторияСогласования_Подключаемый";
	ЭтаФорма.Команды["СогласоватьДокумент"].Действие	 = "СогласоватьДокумент_Подключаемый";
	ЭтаФорма.Команды["ОтменитьСогласование"].Действие	 = "ОтменитьСогласование_Подключаемый";
	ЭтаФорма.Команды["МаршрутСогласования"].Действие	 = "МаршрутСогласования_Подключаемый";
	ЭтаФорма.Команды["ВложенияСогласования"].Действие	 = "ВложенияСогласования_Подключаемый";
	ОпределитьСостояниеОбъекта();
	ЭлементСтатусОбъекта = Элементы.Найти("СтатусОбъекта");
	Если ЭлементСтатусОбъекта <> Неопределено Тогда
		Если ЭлементСтатусОбъекта.Вид = ВидПоляФормы.ПолеВвода Тогда
			ЭлементСтатусОбъекта.УстановитьДействие("ОбработкаВыбора", "СтатусОбъектаОбработкаВыбора"); 
		Иначе
			// В прочих случаях не устанавливаем обработчик выбора.
		КонецЕсли;
	Иначе
		// Нет элемента Статус объекта.
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПринятьКСогласованию_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ПринятьКСогласованию(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСогласования_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ИсторияСогласования(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СогласоватьДокумент_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.СогласоватьДокумент(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьСогласование_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ОтменитьСогласование(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура МаршрутСогласования_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.МаршрутСогласования(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ВложенияСогласования_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ТелеграмВложенныеФайлы(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЭлементаОрганизации_Подключаемый(Элемент) Экспорт
	ОпределитьСостояниеОбъекта(Истина);		
	ВыполнитьПредыдущийОбработчикПриИзмененииОрганизации(Элемент);
КонецПроцедуры		// ПриИзмененииЭлементаОрганизации_Подключаемый()

// Возвращает значение реквизита СостояниеЗаявки на форме ФормаВход.
// Т.к. данный реквизит генерируется кодом, обращение к нему напрямую из
// кода недоступно.
&НаКлиентеНаСервереБезКонтекста
Функция РеквизитСостояниеЗаявки(ФормаВход)
	Возврат ФормаВход["СостояниеЗаявки"];
КонецФункции

// Возвращает значение реквизита СтатусОбъекта на форме ФормаВход.
// Т.к. данный реквизит генерируется кодом, обращение к нему напрямую из
// кода недоступно.
&НаКлиентеНаСервереБезКонтекста
Функция РеквизитСтатусОбъекта(ФормаВход)
	Возврат ФормаВход["СтатусОбъекта"];
КонецФункции

// Возвращает значение реквизита Согласующий на форме ФормаВход.
// Т.к. данный реквизит генерируется кодом, обращение к нему напрямую из
// кода недоступно.
&НаКлиентеНаСервереБезКонтекста
Функция РеквизитСогласующий(ФормаВход)
	Возврат ФормаВход["Согласующий"];
КонецФункции

// Выполняет обработчик ПриИзменении, сопоставленный по умолчанию для элемента Элемент
&НаКлиенте
Процедура ВыполнитьПредыдущийОбработчикПриИзмененииОрганизации(Элемент)
	#Если НЕ ВебКлиент Тогда
	ИмяЭлемента = Элемент.Имя;
	Если ЗначениеЗаполнено(ИмяЭлемента) Тогда
		Для Каждого ТекОбработчикиИзмененияОрганизации Из ЭтаФорма["ОбработчикиИзмененияОрганизации"] Цикл
			Если СокрЛП(ТекОбработчикиИзмененияОрганизации.ИмяРеквизита) = СокрЛП(ИмяЭлемента) Тогда
				СтрокаВыполнения = ТекОбработчикиИзмененияОрганизации.ИмяОбработчика + "(Элемент);";
				Выполнить СтрокаВыполнения;
			Иначе
				// Выполняем поиск далее.
			КонецЕсли; 
		КонецЦикла;	
	Иначе
		// Передан пустой элемент.
	КонецЕсли;
	#КонецЕсли
КонецПроцедуры		// ВыполнитьПредыдущийОбработчикПриИзмененииОрганизации()

#КонецОбласти
